<?php
$label_all = array(
        "大カテ１" => array(
                    "大カテ１の中カテ１" => array(
      	                               "中カテ１の小カテ１" => "大カテ１の中カテ１の小カテ１",
      	                               "中カテ１の小カテ２" => "大カテ１の中カテ１の小カテ２",
      	                               "中カテ１の小カテ３" => "大カテ１の中カテ１の小カテ３",
      	                               "中カテ１の小カテ４" => "大カテ１の中カテ１の小カテ４",
      	                                    ),
                    "大カテ１の中カテ２" => array(
      	                               "中カテ２の小カテ１" => "大カテ１の中カテ２の小カテ１",
      	                               "中カテ２の小カテ２" => "大カテ１の中カテ２の小カテ２",
      	                               "中カテ２の小カテ３" => "大カテ１の中カテ２の小カテ３",
      	                               "中カテ２の小カテ４" => "大カテ１の中カテ２の小カテ４",
      	                                     ),
                    "大カテ１の中カテ３" => array(
      	                               "中カテ３の小カテ１" => "大カテ１の中カテ３の小カテ１",
      	                               "中カテ３の小カテ２" => "大カテ１の中カテ３の小カテ２",
      	                               "中カテ３の小カテ３" => "大カテ１の中カテ３の小カテ３",
      	                               "中カテ３の小カテ４" => "大カテ１の中カテ３の小カテ４",
      	                                     ),
                          ),
        "大カテ２" => array(
                    "大カテ２の中カテ１" => array(
      	                               "中カテ１の小カテ１" => "大カテ２の中カテ１の小カテ１",
      	                               "中カテ１の小カテ２" => "大カテ２の中カテ１の小カテ２",
      	                               "中カテ１の小カテ３" => "大カテ２の中カテ１の小カテ３",
      	                               "中カテ１の小カテ４" => "大カテ２の中カテ１の小カテ４",
      	                                     ),
                    "大カテ２の中カテ２" => array(
      	                                "中カテ２の小カテ１" => "大カテ２の中カテ２の小カテ１",
      	                                "中カテ２の小カテ２" => "大カテ２の中カテ２の小カテ２",
      	                                "中カテ２の小カテ３" => "大カテ２の中カテ２の小カテ３",
      	                                "中カテ２の小カテ４" => "大カテ２の中カテ２の小カテ４",
      	                                     ),
                    "大カテ２の中カテ３" => array(
      	                                "中カテ３の小カテ１" => "大カテ２の中カテ３の小カテ１",
      	                                "中カテ３の小カテ２" => "大カテ２の中カテ３の小カテ２",
      	                                "中カテ３の小カテ３" => "大カテ２の中カテ３の小カテ３",
      	                                "中カテ３の小カテ４" => "大カテ２の中カテ３の小カテ４",
      	                                     ),
  ),
);

// foreach($label_all as $large_cat => $large_val){//大カテを回す
//   echo "--【".$large_cat. "】--<br>\n";//大カテのkeyをecho
//   foreach($large_val as $middle_cat => $middle_val){//中カテ回す
//     echo "----【".$middle_cat. "】----<br>\n";//中カテのkeyをecho
//       foreach ($middle_val as $small_cat => $small_val) {//小カテ回す
//       echo "--------【".$small_val. "】--------<br>\n";//小カテのvalueをecho
//       }
//   }
// }

foreach($label_all as $large_cat => $large_val){
	foreach($large_val as $middle_cat => $middle_val){
		echo $middle_cat. "<br>";
		foreach($middle_val as $small_cat => $small_val){
			echo $small_val. "<br>";
		}
	}
}
?>